const sc = document.querySelector('#sc');
const mn = document.querySelector('#mn');
const cl = document.querySelector('#cl');
const cBack = document.querySelector('#cyber_back');
const sBack = document.querySelector('#steam_back');
const cBackCont = document.querySelector('.cyber_back_container');
const sBackCont = document.querySelector('.steam_back_container');
const cyber=document.querySelectorAll('.cyber')
const steem=document.querySelectorAll('.steem')
const bt1=document.querySelector('#bt1')
const bt2=document.querySelector('#bt2')
const bt3=document.querySelector('#bt3')
const bt4=document.querySelector('#bt4')
const bt5=document.querySelector('#bt5')
const bt6=document.querySelector('#bt6')
const bt7=document.querySelector('#bt7')
const bt9=document.querySelector('#bt9')
const bt10=document.querySelector('#bt10')
const bt11=document.querySelector('#bt11')
const bt12=document.querySelector('#bt12')
const bt13=document.querySelector('#bt13')
const bt14=document.querySelector('#bt14')
const btMass = [bt1, bt2, bt3, bt4, bt5, bt6, bt7]
const cImg=document.querySelector('.cImage')
const cA=document.querySelector('.cyber_a')
const cAP=document.querySelector('.cyber_a_p')
const cP=document.querySelector('.c_paragraph')
const sImg=document.querySelector('.sImage')
const sA=document.querySelector('.steam_a')
const sAP=document.querySelector('.steam_a_p')
const sP=document.querySelector('.s_paragraph')
const lang = document.querySelector('.lang')
let rotated = false; // Флаг для чередования состояний
let langChange = false //изменение языка
let lastCyberButton = bt1; //последняя нажатая кнопка(будущее)
let lastSteamButton = bt5; //последняя нажатая кнопка(прошлое)
let refType=1
function hideButtons(){
    bt1.style.display="none"
    bt2.style.display="none"
    bt3.style.display="none"
    bt4.style.display="none"
    bt13.style.display="none"
    bt14.style.display="none"
}
function showButtons(num){
if (num>=1){
bt1.style.display="block"
}
if (num>=2){
    bt2.style.display="block"
    }
    if (num>=3){
        bt3.style.display="block"
        }
        if (num>=4){
            bt4.style.display="block"
            }
            if (num>=5){
                bt13.style.display="block"
                }
                if (num>=6){
                    bt14.style.display="block"
                    }
            
        
}
document.addEventListener('DOMContentLoaded',()=>{
   hideButtons()
   showButtons(2)
})
lang.addEventListener('click', () => {
    if (!langChange) {
        lang.style.transform = `rotateY(180deg)`
        setTimeout(()=>{lang.src = 'img/rus.png'}, 300)
    }
    else {
        lang.style.transform = `rotateX(0deg)`
        setTimeout(()=>{lang.src = 'img/bel.png'}, 300)
    }
    langChange = !langChange
    if (!langChange){
        bt9.innerHTML="героі"
        bt10.innerHTML="навука"
        bt11.innerHTML="эканоміка"
        bt12.innerHTML="пражыванне"
    }else{
        bt9.innerHTML="герои"
        bt10.innerHTML="наука"
        bt11.innerHTML="экономика"
        bt12.innerHTML="проживание"
    }
    lastCyberButton.click();
    lastSteamButton.click();
})

cl.addEventListener('click', () => {
    let m, s; // Углы поворота для минутной и секундной стрелок

    if (!rotated) {
        m = Math.random() * 170;
        s = Math.random() * 170;
        sBackCont.style.flex=1;
        cBackCont.style.flex=0;

       for( i of cyber){
        i.style.visibility="hidden"
        i.style.zIndex=0
        i.style.opacity="0"}


        for(i of steem){
            i.style.visibility="visible"
            i.style.zIndex=999;

            i.style.opacity="80"}
        document.querySelector(".clock").style.marginLeft="10%"

    } 
    else {
        document.querySelector(".clock").style.marginLeft="50%"
        m =1800 + 190 + Math.random() * 170;
        s =1800 + 190 + Math.random() * 170;
        cBackCont.style.flex=1;
        sBackCont.style.flex=0;
        for(i of cyber){
            i.style.visibility="visible"
            i.style.zIndex=999
            i.style.opacity="80"
        
        }

        for(i of steem){
            i.style.visibility="hidden"
            i.style.zIndex=0
            i.style.opacity="0"
        }
    }

    // Анимация стрелок
    sc.style.transform = `rotate(${s}deg)`;
    mn.style.transform = `rotate(${m}deg)`;

    rotated = !rotated;
});

bt1.addEventListener('click', () => {

 
        lastCyberButton = bt1;
        switch(refType){
            case 1:{
                cImg.src = 'img/marina.jpg'
                cA.href = 'https://www.belarus.kp.ru/daily/27583.5/4908206/?ysclid=m1l1sphj84811237830'
        if (!langChange) {
        cAP.innerText = 'Марина Василевская'
        cP.innerText = 'Родилась 14 сентября 1990 года в Минске, в рабочей семье, отец и мать работали дворниками. Окончила среднюю школу № 151 в Минске. После окончания школы профессионально занималась бальными танцами. В 2010—2011 годах работала в Минском отделении Белорусской железной дороги, в 2011 году — в компании с дополнительной ответственностью «Сатурн-2», занимавшейся оптовой торговлей продуктами питания. С 2012 года заочно училась на экономическом факультете Минского инновационного университета по специальности «менеджмент (информационный)». В 2013—2015 годах работала в ООО «Мариана Инвест», которое занималось розничной торговлей колбасными изделиями и копченостями. С 2017 года работала бортпроводницей-инструктором авиакомпании «Белавиа» и летала в составе экипажей пассажирских самолётов Boeing и Embraer.'}
    else {
        cAP.innerText = 'Марына Васілеўская'
        cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
   }
break
case 2:{
    if (!langChange) {
        cImg.src = 'img/наука.jpg'
        cAP.innerText = 'Разработка лекарственных препаратов:'
        cP.innerText = 'Разработка лекарственных препаратов: В Беларуси  имеются  фармацевтические  компании,  которые  производят  лекарства,  в  том  числе  для  лечения  онкологических  заболеваний,  сердечно-сосудистых  заболеваний  и  др. Развитие  медицинских  технологий:  В  Беларуси  проводятся  исследования  в  области  трансплантологии,  регенеративной  медицины,  и  разрабатываются  новые  методы  диагностики  и  лечения. '}
    else {
        cAP.innerText = 'Марына Васілеўская'
        cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 3:{
    if (!langChange) {
        cImg.src = 'img/экономика.jpg'
        cAP.innerText = 'Интеграция в Евразийский экономический союз:'
        cP.innerText = ' Беларусь является членом Евразийского экономического союза, что предоставляет ей доступ к единому рынку с Россией, Казахстаном, Арменией и Киргизией. Союз обеспечивает беспрепятственную торговлю товарами, услугами и рабочей силой, что способствует развитию белорусской экономики.Сотрудничество в рамках ЕАЭС также позволяет Беларуси привлекать инвестиции и технологии из других стран-участниц.'}
    else {
        cAP.innerText = 'Марына Васілеўская'
        cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 4:{
    if (!langChange) {
        cImg.src = 'img/проживание.jpg'
        cAP.innerText = 'Высокий уровень безопасности:'
        cP.innerText = 'Беларусь отличается низким уровнем преступности и высокой степенью безопасности. Это привлекает многих людей, желающих жить в спокойной и стабильной обстановке. '}
    else {
        cAP.innerText = 'Марына Васілеўская'
        cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
}}

   )

bt2.addEventListener('click', () => {
    lastCyberButton = bt2;
  
    cA.href = 'https://belta.by/president/view/letchikam-andreju-nichiporchiku-i-nikite-kukonenko-posmertno-prisvoeno-zvanie-geroj-belarusi-471262-2021/'
    switch(refType){
        case 1:{
            cImg.src = 'img/nichiporchik.jpg'
    if (!langChange) {
    cAP.innerText = 'Андрей Ничипорчик'
    cP.innerText = 'Родился 17 октября 1987 года в Поставах в семье военного лётчика-снайпера Владимира Ничипорчика[1]. Отец 33 года своей жизни посвятил небу. Он занимался формированием пилотажной группы ВВС и войск ПВО «Белая Русь». Мама – учитель в начальной школе. Будущий герой с детства мечтал стать лётчиком[2].В третьем классе Андрей поступил в девятую лидскую школу. Представлял учебное заведение на различных спортивных соревнованиях, хорошо знал английский язык. В 2005 году окончил её[2]. Затем будущий летчик поступил на авиационный факультет Военной академии Республики Беларусь[1].С 2016 года служил инструктором – готовил к полётам на Як-130 молодых пилотов. С 2017 года принимал участие в воздушных парадах, демонстрационных полётах. Неоднократно участвовал в учениях и международных конкурсах в Беларуси и за рубежом. За свою службу освоил Як-52, Л-39, Су-25, Як-130[1].'
    }
    else{
        cAP.innerText = 'Андрэй Нічыпорчык'
        cP.innerText = 'Нарадзіўся 17 кастрычніка 1987 года ў Паставах у сям\'і ваеннага лётчыка-снайпера Уладзіміра Нічыпорчыка[1]. Бацька 33 гады свайго жыцця прысвяціў небу. Ён займаўся фарміраваннем пілатажнай групы ВПС і войскаў СПА "Белая Русь". Мама - настаўнік у пачатковай школе. Будучы герой з дзяцінства марыў стаць лётчыкам[2].У трэцім класе Андрэй паступіў у дзявятую лідскую школу. Прадстаўляў навучальную ўстанову на розных спартыўных спаборніцтвах, добра ведаў англійскую мову. У 2005 годзе скончыў яе[2]. Потым будучы лётчык паступіў на авіяцыйны факультэт Ваеннай акадэміі Рэспублікі Беларусь[1].З 2016 года служыў інструктарам - рыхтаваў да палётаў на Як-130 маладых пілотаў. З 2017 года браў удзел у паветраных парадах, дэманстрацыйных палётах. Неаднаразова ўдзельнічаў у вучэннях і міжнародных конкурсах у Беларусі і за мяжой. За сваю службу асвоіў Як-52, Л-39, Су-25, Як-130[1].' 
    }
    break
    }

    case 2:{
        cImg.src = 'img/наука.jpg'
        cA.href = '';
            if (!langChange) {
            cAP.innerText = 'Информационные технологии:'
            cP.innerText = 'Развитие  IT-отрасли:  В  Беларуси  развивается  IT-отрасль,  с  многочисленными  компаниями,  работающими  в  области  разработки  программного  обеспечения,  веб-дизайна,  и  других  IT-услуг. Разработка  инновационных  решений:  Белорусские  IT-специалисты  разрабатывают  инновационные  решения  в  различных  областях,  в  том  числе  в  образовании,  медицине,  и  индустрии.'
            }
            else{
                cAP.innerText = 'Андрэй Нічыпорчык'
                cP.innerText = 'Нарадзіўся 17 кастрычніка 1987 года ў Паставах у сям\'і ваеннага лётчыка-снайпера Уладзіміра Нічыпорчыка[1]. Бацька 33 гады свайго жыцця прысвяціў небу. Ён займаўся фарміраваннем пілатажнай групы ВПС і войскаў СПА "Белая Русь". Мама - настаўнік у пачатковай школе. Будучы герой з дзяцінства марыў стаць лётчыкам[2].У трэцім класе Андрэй паступіў у дзявятую лідскую школу. Прадстаўляў навучальную ўстанову на розных спартыўных спаборніцтвах, добра ведаў англійскую мову. У 2005 годзе скончыў яе[2]. Потым будучы лётчык паступіў на авіяцыйны факультэт Ваеннай акадэміі Рэспублікі Беларусь[1].З 2016 года служыў інструктарам - рыхтаваў да палётаў на Як-130 маладых пілотаў. З 2017 года браў удзел у паветраных парадах, дэманстрацыйных палётах. Неаднаразова ўдзельнічаў у вучэннях і міжнародных конкурсах у Беларусі і за мяжой. За сваю службу асвоіў Як-52, Л-39, Су-25, Як-130[1].' 
            } 
            break

}
case 3:{
    cImg.src = 'img/промышленность.jpg'
    cA.href = '';
    if (!langChange) {
    cAP.innerText = 'Развитие промышленности:'
    cP.innerText = 'Беларусь обладает развитой промышленностью, которая включает в себя производство автомобилей, тракторов, сельскохозяйственной техники, химических веществ, нефтепродуктов, электроники и т.д. Страна является ведущим производителем тракторов и грузовых автомобилей в СНГ. Правительство Беларуси активно поддерживает развитие промышленности, предоставляя налоговые льготы и субсидии.'
    }
    else{
        cAP.innerText = 'Андрэй Нічыпорчык'
        cP.innerText = 'Нарадзіўся 17 кастрычніка 1987 года ў Паставах у сям\'і ваеннага лётчыка-снайпера Уладзіміра Нічыпорчыка[1]. Бацька 33 гады свайго жыцця прысвяціў небу. Ён займаўся фарміраваннем пілатажнай групы ВПС і войскаў СПА "Белая Русь". Мама - настаўнік у пачатковай школе. Будучы герой з дзяцінства марыў стаць лётчыкам[2].У трэцім класе Андрэй паступіў у дзявятую лідскую школу. Прадстаўляў навучальную ўстанову на розных спартыўных спаборніцтвах, добра ведаў англійскую мову. У 2005 годзе скончыў яе[2]. Потым будучы лётчык паступіў на авіяцыйны факультэт Ваеннай акадэміі Рэспублікі Беларусь[1].З 2016 года служыў інструктарам - рыхтаваў да палётаў на Як-130 маладых пілотаў. З 2017 года браў удзел у паветраных парадах, дэманстрацыйных палётах. Неаднаразова ўдзельнічаў у вучэннях і міжнародных конкурсах у Беларусі і за мяжой. За сваю службу асвоіў Як-52, Л-39, Су-25, Як-130[1].' 
    } 
break
}
case 4:{
    cA.href = '';
    cImg.src = 'img/проживание.jpg'
    if (!langChange) {
    cAP.innerText = 'Доступное жилье:'
    cP.innerText = 'Стоимость жилья в Беларуси сравнительно ниже, чем в некоторых других странах.  Это делает ее привлекательной для людей с ограниченным бюджетом. '
    }
    else{
        cAP.innerText = 'Андрэй Нічыпорчык'
        cP.innerText = 'Нарадзіўся 17 кастрычніка 1987 года ў Паставах у сям\'і ваеннага лётчыка-снайпера Уладзіміра Нічыпорчыка[1]. Бацька 33 гады свайго жыцця прысвяціў небу. Ён займаўся фарміраваннем пілатажнай групы ВПС і войскаў СПА "Белая Русь". Мама - настаўнік у пачатковай школе. Будучы герой з дзяцінства марыў стаць лётчыкам[2].У трэцім класе Андрэй паступіў у дзявятую лідскую школу. Прадстаўляў навучальную ўстанову на розных спартыўных спаборніцтвах, добра ведаў англійскую мову. У 2005 годзе скончыў яе[2]. Потым будучы лётчык паступіў на авіяцыйны факультэт Ваеннай акадэміі Рэспублікі Беларусь[1].З 2016 года служыў інструктарам - рыхтаваў да палётаў на Як-130 маладых пілотаў. З 2017 года браў удзел у паветраных парадах, дэманстрацыйных палётах. Неаднаразова ўдзельнічаў у вучэннях і міжнародных конкурсах у Беларусі і за мяжой. За сваю службу асвоіў Як-52, Л-39, Су-25, Як-130[1].' 
    } 
break
}
}
})

bt3.addEventListener('click', () => {
    lastCyberButton = bt3;
    switch(refType){
        case 1:{

    cImg.src = 'img/marina.jpg'
    cA.href = 'https://www.belarus.kp.ru/daily/27583.5/4908206/?ysclid=m1l1sphj84811237830'
if (!langChange) {
cAP.innerText = 'Марина Василевская'
cP.innerText = 'Родилась 14 сентября 1990 года в Минске, в рабочей семье, отец и мать работали дворниками. Окончила среднюю школу № 151 в Минске. После окончания школы профессионально занималась бальными танцами. В 2010—2011 годах работала в Минском отделении Белорусской железной дороги, в 2011 году — в компании с дополнительной ответственностью «Сатурн-2», занимавшейся оптовой торговлей продуктами питания. С 2012 года заочно училась на экономическом факультете Минского инновационного университета по специальности «менеджмент (информационный)». В 2013—2015 годах работала в ООО «Мариана Инвест», которое занималось розничной торговлей колбасными изделиями и копченостями. С 2017 года работала бортпроводницей-инструктором авиакомпании «Белавиа» и летала в составе экипажей пассажирских самолётов Boeing и Embraer.'}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 2:{

    cImg.src = 'img/наука.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Космические  исследования'
cP.innerText = 'Разработка  спутников:  Беларусь  участвует  в  космических  исследованиях  и  разрабатывает  собственные  спутники  для  земного  мониторинга  и  других  целей. '}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 3:{

    cImg.src = 'img/экономика.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Сельское хозяйство:'
cP.innerText = ' Беларусь обладает значительными ресурсами для сельского хозяйства, включая плодородные почвы и благоприятный климат. Страна является одним из ведущих производителей картофеля, молочной продукции и зерновых в СНГ.Правительство Беларуси поддерживает развитие сельскохозяйственного сектора, в том числе путем субсидирования цен на продукцию и предоставления льготных кредитов.'}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 4:{

    cImg.src = 'img/проживание.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Бесплатное образование и здравоохранение: '
cP.innerText = 'Беларусь предоставляет своим гражданам бесплатное образование и медицинское обслуживание.  Это делает ее привлекательной для семей с детьми и пожилых людей.'}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
 
}     
}

)

bt4.addEventListener('click', () => {
    lastCyberButton = bt4;
    switch(refType){
        case 1:{

    cImg.src = 'img/marina.jpg'
    cA.href = 'https://www.belarus.kp.ru/daily/27583.5/4908206/?ysclid=m1l1sphj84811237830'
if (!langChange) {
cAP.innerText = 'Марина Василевская'
cP.innerText = 'Родилась 14 сентября 1990 года в Минске, в рабочей семье, отец и мать работали дворниками. Окончила среднюю школу № 151 в Минске. После окончания школы профессионально занималась бальными танцами. В 2010—2011 годах работала в Минском отделении Белорусской железной дороги, в 2011 году — в компании с дополнительной ответственностью «Сатурн-2», занимавшейся оптовой торговлей продуктами питания. С 2012 года заочно училась на экономическом факультете Минского инновационного университета по специальности «менеджмент (информационный)». В 2013—2015 годах работала в ООО «Мариана Инвест», которое занималось розничной торговлей колбасными изделиями и копченостями. С 2017 года работала бортпроводницей-инструктором авиакомпании «Белавиа» и летала в составе экипажей пассажирских самолётов Boeing и Embraer.'}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 2:{

    cImg.src = 'img/наука.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Энергетика:'
cP.innerText = 'Разработка  и  применение  возобновляемых  источников  энергии:  Беларусь  проводит  исследования  в  области  возобновляемых  источников  энергии,  таких  как  солнечная  и  ветровая  энергетика.'}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 3:{

    cImg.src = 'img/туризм.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Туризм'
cP.innerText = '  Беларусь обладает значительным туристическим потенциалом. Страна привлекает туристов своей богатой историей, культурой, природой и архитектурой. В последние годы правительство Беларуси активно развивает туристическую инфраструктуру.  дороги,  коммуникации,  что  делает  ее  удобной  для  жизни  и  работы. '}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 4:{

    cImg.src = 'img/проживание.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Развитая инфраструктура'
cP.innerText = ' Беларусь обладает развитой инфраструктурой,  включая  дороги,  железные  дороги,  коммуникации,  что  делает  ее  удобной  для  жизни  и  работы. '}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
}
})
bt14.addEventListener('click', () => {
    lastCyberButton = bt14;
    switch(refType){
        case 4:{

    cImg.src = 'img/проживание.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Доступные цены на продукты питания'
cP.innerText = 'Цены на продукты питания в Беларуси сравнительно ниже, чем в некоторых других странах. .'}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
}
})
bt13.addEventListener('click', () => {
    lastCyberButton = bt13;
    switch(refType){
        case 1:{

    cImg.src = 'img/marina.jpg'
    cA.href = 'https://www.belarus.kp.ru/daily/27583.5/4908206/?ysclid=m1l1sphj84811237830'
if (!langChange) {
cAP.innerText = 'Марина Василевская'
cP.innerText = 'Родилась 14 сентября 1990 года в Минске, в рабочей семье, отец и мать работали дворниками. Окончила среднюю школу № 151 в Минске. После окончания школы профессионально занималась бальными танцами. В 2010—2011 годах работала в Минском отделении Белорусской железной дороги, в 2011 году — в компании с дополнительной ответственностью «Сатурн-2», занимавшейся оптовой торговлей продуктами питания. С 2012 года заочно училась на экономическом факультете Минского инновационного университета по специальности «менеджмент (информационный)». В 2013—2015 годах работала в ООО «Мариана Инвест», которое занималось розничной торговлей колбасными изделиями и копченостями. С 2017 года работала бортпроводницей-инструктором авиакомпании «Белавиа» и летала в составе экипажей пассажирских самолётов Boeing и Embraer.'}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 2:{

    cImg.src = 'img/сельское хозяйство.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = ' Сельскохозяйственные науки:'
cP.innerText = 'Разработка новых сортов растений: Белорусские ученые добились значительных успехов в селекции зерновых, картофеля, льна и других сельскохозяйственных культур. Развитие технологий  животноводства:  Ученые  разработали  новые  методы  кормления,  ухода  за  животными,  что  позволило  увеличить  производительность  животноводства. '}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 3:{

    cImg.src = 'img/экономика.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Высококвалифицированная рабочая сила:'
cP.innerText = '  Беларусь обладает высококвалифицированной рабочей силой, которая обладает знаниями и навыками в различных областях, включая инженерное дело, IT, медицину и образование. Это делает страну привлекательной для иностранных инвесторов. '}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
case 4:{

    cImg.src = 'img/проживание.jpg'
    cA.href = ''
if (!langChange) {
cAP.innerText = 'Развитая  культурная  жизнь'
cP.innerText = ' Беларусь  обладает  богатой  культурой  и  традициями,  с  множеством  театров,  музеев,  концертных  залов,  что  делает  ее  привлекательной  для  людей,  интересующихся  культурой  и  искусством.'}
else {
cAP.innerText = 'Марына Васілеўская'
cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
break
}
}
})
bt5.addEventListener('click', () => {
    lastSteamButton = bt5;

        sImg.src = 'img/kandrat.jpg'
        sA.href = 'https://gcbs-brest.by/pamyatnik-v.-n.-karvatu#'
        sAP.innerText = 'Кандрат Крапива'
        sP.innerText = 'Родился 22 февраля (5 марта) 1896 года в деревне Низок (ныне Узденский район Минской области Республики Беларусь) в крестьянской семье. Родители, Кондрат Михайлович и Пелагея Даниловна Атраховичи, имели шесть десятин земли, нажитых тяжелой работой, хотели, чтобы они остались единственному сыну Кондрату. Учился в церковно-приходской школе в родной деревне, Узденском народном училище, четырёхклассном городском училище города Столбцы, из которого в 1912 году перевёлся в училище в Койданово (теперь Дзержинск).В 1913 году экстерном сдал экзамен на звание народного учителя. Осенью 1914 года получил место учителя в деревне Мишаны Минской губернии. Проработав год, был мобилизован в армию. В марте 1916 года окончил Гатчинскую школу прапорщиков. Воевал на Румынском фронте. Был демобилизован в феврале 1918 года. В 1939 году участвовал в Польском походе РККА. Участник советско-финской войны 1939—1940 годов. В начале Великой Отечественной войны работал во фронтовой газете «За Советскую Беларусь», в «Красноармейской правде», в 1943—1945 годах редактировал сатирическую газету-плакат «Раздавим фашистскую гадину».        В 1919 году женился на Елене Константиновне Махнач, медсестре по образованию. Кондрат Крапива пережил свою жену на 27 лет и больше не женился.'
  
})

bt6.addEventListener('click', () => {
    lastSteamButton = bt6;

        sImg.src = 'img/bagrat.jpg'
        sA.href = 'https://gcbs-brest.by/pamyatnik-v.-n.-karvatu#:~:text=%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%BF%D0%B5%D1%80%D0%B2%D0%BE%D0%BC%D1%83%20%D0%93%D0%B5%D1%80%D0%BE%D1%8E%20%D0%A0%D0%B5%D1%81%D0%BF%D1%83%D0%B1%D0%BB%D0%B8%D0%BA%D0%B8%20%D0%91%D0%B5%D0%BB%D0%B0%D1%80%D1%83%D1%81%D1%8C,%D1%81%D0%BE%D1%8E%D0%B7%D0%B0%20%D1%85%D1%83%D0%B4%D0%BE%D0%B6%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2%20%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80%20%D0%9C%D0%B8%D1%85%D0%B0%D0%B9%D0%BB%D0%BE%D0%B2%D0%B8%D1%87%20%D0%9A%D0%BE%D1%81%D1%82%D1%80%D1%8E%D0%BA%D0%BE%D0%B2.'
        sAP.innerText = 'Мемориальный комплекс, посвященный операции "Багратион"'
        sP.innerText = 'К 70-летию освобождения Беларуси от немецко-фашистских захватчиков в Светлогорском районе был основан первый в мире мемориальный комплекс, посвященный одной из величайших военных операций в истории человечества. Именно здесь, у деревни Раковичи на 71-м километре шоссе Бобруйск – Мозырь, 23 июня 1944 года началось масштабное наступление советских войск, которое продлилось более двух месяцев. В результате oперации, получившей кодовое название в честь героя Отечественной войны 1812 года полководца Петра Багратиона, были освобождены Беларусь, частично территории Прибалтики и Польши, а главное, нанесен сокрушительный удар по  группе немецких армий "Центр", который окончательно ослабил Германию. Первым объектом комплекса стал 7-метровый мемориал-барельеф, в центре которого – фигуры четырех полководцев, обеспечивших успех операции. В мемориальный комплекс также включены блиндажеобразный музей, посвященный операции "Багратион", часовня с поминальной книгой, экспозиция боевой техники и вооружений.'

})

bt7.addEventListener('click', () => {
    lastSteamButton = bt7;

        sImg.src = 'img/ola.jpg'
        sA.href = 'https://gcbs-brest.by/pamyatnik-v.-n.-karvatu#:~:text=%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%BF%D0%B5%D1%80%D0%B2%D0%BE%D0%BC%D1%83%20%D0%93%D0%B5%D1%80%D0%BE%D1%8E%20%D0%A0%D0%B5%D1%81%D0%BF%D1%83%D0%B1%D0%BB%D0%B8%D0%BA%D0%B8%20%D0%91%D0%B5%D0%BB%D0%B0%D1%80%D1%83%D1%81%D1%8C,%D1%81%D0%BE%D1%8E%D0%B7%D0%B0%20%D1%85%D1%83%D0%B4%D0%BE%D0%B6%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2%20%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80%20%D0%9C%D0%B8%D1%85%D0%B0%D0%B9%D0%BB%D0%BE%D0%B2%D0%B8%D1%87%20%D0%9A%D0%BE%D1%81%D1%82%D1%80%D1%8E%D0%BA%D0%BE%D0%B2.'
        sAP.innerText = 'Мемориальный комплекс "Ола"'
        sP.innerText = 'Впечатляющий мемориал создан на месте одноименной деревни, сожженной нацистами в годы Великой Отечественной войны. Открытие этого нового символа памяти и скорби для всех белорусов состоялось в год 75-летия Великой Победы и день начала войны – 21 июня 2020 г. …Деревня Ола была оккупирована в конце июля 1941 года. Утром 14 января 1944 года немецкий карательный отряд вместе с войсковой частью, которая насчитывала около 1 тыс. солдат, окружил селение. Людей загоняли в дома, которые затем поджигали. Тех, кто пытался убежать, расстреливали из пулеметов и автоматов, бросали в огонь живыми. В тот роковой день было убито 1758 мирных жителей, более половины из которых – дети – 950 загубленных юных жизней. И это почти двенадцать Хатыней! После войны деревня Ола не возродилась. В 1958 году на братской могиле, в которой покоятся мирные жители и советские воины (2253 человека), был установлен памятник – скульптура коленопреклоненного солдата с венком. А к 75-летию Победы захоронение превратилось в масштабный мемориальный комплекс "Ола". Символичное место объединяет три части – входную группу, мемориальную зону и соединяющий их пешеходный маршрут по бывшей деревенской улице. В центре мемориальной зоны возвышается символичный крест и колокол. Рядом – звонница в виде стилизованного деревенского сарая с количеством колоколов по числу деревень, жители которых здесь погибли.'

    
})

// bt8.addEventListener('click', () => {
//     lastSteamButton = bt8;

//         sImg.src = 'img/karvat_krapiva_pamyatnik.jpg'
//         sA.href = 'https://gcbs-brest.by/pamyatnik-v.-n.-karvatu#:~:text=%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%BF%D0%B5%D1%80%D0%B2%D0%BE%D0%BC%D1%83%20%D0%93%D0%B5%D1%80%D0%BE%D1%8E%20%D0%A0%D0%B5%D1%81%D0%BF%D1%83%D0%B1%D0%BB%D0%B8%D0%BA%D0%B8%20%D0%91%D0%B5%D0%BB%D0%B0%D1%80%D1%83%D1%81%D1%8C,%D1%81%D0%BE%D1%8E%D0%B7%D0%B0%20%D1%85%D1%83%D0%B4%D0%BE%D0%B6%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2%20%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80%20%D0%9C%D0%B8%D1%85%D0%B0%D0%B9%D0%BB%D0%BE%D0%B2%D0%B8%D1%87%20%D0%9A%D0%BE%D1%81%D1%82%D1%80%D1%8E%D0%BA%D0%BE%D0%B2.'
//         sAP.innerText = 'Кандрат Крапива'
//         sP.innerText = 'Родился 22 февраля (5 марта) 1896 года в деревне Низок (ныне Узденский район Минской области Республики Беларусь) в крестьянской семье. Родители, Кондрат Михайлович и Пелагея Даниловна Атраховичи, имели шесть десятин земли, нажитых тяжелой работой, хотели, чтобы они остались единственному сыну Кондрату[4]. Учился в церковно-приходской школе в родной деревне, Узденском народном училище, четырёхклассном городском училище города Столбцы, из которого в 1912 году перевёлся в училище в Койданово (теперь Дзержинск).В 1913 году экстерном сдал экзамен на звание народного учителя. Осенью 1914 года получил место учителя в деревне Мишаны Минской губернии. Проработав год, был мобилизован в армию. В марте 1916 года окончил Гатчинскую школу прапорщиков. Воевал на Румынском фронте. Был демобилизован в феврале 1918 года.'


// })

bt9.addEventListener('click', () => {
    lastSteamButton = bt9;
    refType=1
    hideButtons()
    showButtons(2)
    cImg.src = 'img/marina.jpg'
        cA.href = 'https://www.belarus.kp.ru/daily/27583.5/4908206/?ysclid=m1l1sphj84811237830'
        lastCyberButton = bt1;
    
        if (!langChange) {
        cAP.innerText = 'Марина Василевская'
        cP.innerText = 'Родилась 14 сентября 1990 года в Минске, в рабочей семье, отец и мать работали дворниками. Окончила среднюю школу № 151 в Минске. После окончания школы профессионально занималась бальными танцами. В 2010—2011 годах работала в Минском отделении Белорусской железной дороги, в 2011 году — в компании с дополнительной ответственностью «Сатурн-2», занимавшейся оптовой торговлей продуктами питания. С 2012 года заочно училась на экономическом факультете Минского инновационного университета по специальности «менеджмент (информационный)». В 2013—2015 годах работала в ООО «Мариана Инвест», которое занималось розничной торговлей колбасными изделиями и копченостями. С 2017 года работала бортпроводницей-инструктором авиакомпании «Белавиа» и летала в составе экипажей пассажирских самолётов Boeing и Embraer.'}
    else {
        cAP.innerText = 'Марына Васілеўская'
        cP.innerText = "Нарадзілася 14 верасня 1990 года ў Менску, у працоўнай сям'і, бацька і маці працавалі дворнікамі. Скончыла сярэднюю школу №151 у Мінску. Пасля заканчэння школы прафесійна займалася бальнымі танцамі. У 2010—2011 гадах працавала ў Мінскім аддзяленні Беларускай чыгункі, у 2011 годзе — у кампаніі з дадатковай адказнасцю 'Сатурн-2', якая займалася аптовым гандлем прадуктамі харчавання. З 2012 года завочна вучылася на эканамічным факультэце Мінскага інавацыйнага ўніверсітэта па спецыяльнасці 'менеджмент (інфармацыйны)'. У 2013—2015 гадах працавала ў ТАА «Марыяна Інвест», якое займалася рознічным гандлем каўбаснымі вырабамі і вэнджанінай. З 2017 года працавала бортправадніцай-інструктарам авіякампаніі 'Белавія' і лётала ў складзе экіпажаў пасажырскіх самалётаў Boeing і Embraer."}
   }
)
bt10.addEventListener('click', () => {
    lastSteamButton = bt10;
    refType=2
    hideButtons()
    showButtons(5)
    cImg.src = 'img/наука.jpg'
        cA.href = ''
        cAP.innerText = 'Разработка лекарственных препаратов: '
        cP.innerText = 'В Беларуси  имеются  фармацевтические  компании,  которые  производят  лекарства,  в  том  числе  для  лечения  онкологических  заболеваний,  сердечно-сосудистых  заболеваний  и  др. Развитие  медицинских  технологий:  В  Беларуси  проводятся  исследования  в  области  трансплантологии,  регенеративной  медицины,  и  разрабатываются  новые  методы  диагностики  и  лечения. '
   
})
bt11.addEventListener('click', () => {
    lastSteamButton = bt11;
    refType=3
    hideButtons()
    showButtons(5)
    cImg.src = "img/экономика.jpg"
        cA.href = ''
        cAP.innerText = 'Интеграция в Евразийский экономический союз:'
        cP.innerText = ' Беларусь является членом Евразийского экономического союза, что предоставляет ей доступ к единому рынку с Россией, Казахстаном, Арменией и Киргизией. Союз обеспечивает беспрепятственную торговлю товарами, услугами и рабочей силой, что способствует развитию белорусской экономики.Сотрудничество в рамках ЕАЭС также позволяет Беларуси привлекать инвестиции и технологии из других стран-участниц.'
   
})
bt12.addEventListener('click', () => {
    refType=4
    lastSteamButton = bt12;
    hideButtons()
    showButtons(6)
    cImg.src = 'img/проживание.jpg'
        cA.href = ''
        if (!langChange){
        cAP.innerText = 'Высокий уровень безопасности:'
        cP.innerText = ' Беларусь отличается низким уровнем преступности и высокой степенью безопасности. Это привлекает многих людей, желающих жить в спокойной и стабильной обстановке. '
        }else{

        }
})